#настройка среды, объекта и т. п.:
V = 0.3
M = 300
X_shark = 200
Y_shark = 50
g = 10
Vo2 = 0.005
Ro2 = 1.275
ambient_density = 1000
Patm = 100_000
step = 7
M_fish = 1
max_cnt_o2 = 4
################################################################
#настройка элементов приложения:
WIDTH_canvas = 700
HEIGHT_canvas = 700
WIDTH = 1000
HEIGHT = 705
################################################################
#создание базовых цветов:
BG_canvas = '#0f489c'
################################################################
#спавн рыбок:
a = []
